import emoji

red_circle_sign = emoji.emojize(":red_circle:")
apple_sign = emoji.emojize(":green_apple:")
checkmark_sign = emoji.emojize(":round_pushpin:")

# transitions dict - dictionary with all diseases states transition dictionaries
# as values and diseases strings as keys
transitions_dict = {}

# List of all diseases
diseases_list = ["Алергія", "Біль у горлі", "Кашель", "Діарея", "Опік",
                 "Тютюнопаління", "Закрита травма",
                 "Відкрита рана", "Стрес", "Підозра на туберкульоз",
                 "Підозра на ВІЛ/СНІД", "Безсоння",
                 "Біль у м'язах", "Біль у спині", "Ураження губ",
                 "Головний біль", "Запор", "Короста",
                 "Педикульоз", "Печія", "Підвищення температури тіла",
                 "Остеопороз", "Риніт", "Грип", "Остеоартроз",
                 "Дефіцит йоду", "Вугрова хвороба", "Зубний біль",
                 "Недостатність підшлункової залози",
                 "Порушення функції жовчного міхура",
                 "Захворювання нирок і сечовивідних шляхів",
                 "Клімактеричні розлади", "Контрацепція",
                 "Біль органів травлення та сечових шляхів",
                 "Варикозне розширення вен", "Сечокам'яна хвороба",
                 "Коронавірус"]


# Define done, initial and questioning state
DONE, INIT, QUESTIONING = range(3)


# Allergy states
ALLERGY_SYMPTOMS, ALLERGY_ALLERGENES_CONTACT = range(3, 5)


allergy_dict = {
    (INIT, "Алергія"): (
        ALLERGY_SYMPTOMS,
        "Чи наявні один або декілька симптомів алергії:\n\n"
        "{red_circle_sign}чхання,\n"
        f"{red_circle_sign}свербіж і почервоніння очей,\n"
        f"{red_circle_sign}водянисті виділення з носа,\n"
        f"{red_circle_sign}шкірні висипи,\n"
        f"{red_circle_sign}шкірний свербіж"),
    (ALLERGY_SYMPTOMS, "Так"): (
        ALLERGY_ALLERGENES_CONTACT,
        "Чи наявний зв'язок симптомів із можливим контактом "
        "з алергенами:\n\n"
        f"{red_circle_sign}домашні тварини, сухий корм для риб,\n"
        f"{red_circle_sign}період цвітіння рослин,\n"
        f"{red_circle_sign}контакт із хімічними речовинами,\n"
        f"{red_circle_sign}прийом лікарських засобів,\n"
        f"{red_circle_sign}уживання деяких продуктів харчування,\n"
        f"{red_circle_sign}укуси комах,\n"
        f"{red_circle_sign}сонячне опромінення, холод"),
    (ALLERGY_SYMPTOMS, "Ні"): (
        DONE,
        "Необхідно звернутися до лікаря для уточнення діагнозу"),
    (ALLERGY_ALLERGENES_CONTACT, "Так"): (
        DONE,
        "Необхідно звернутися до лікаря "
        "для уточнення діагнозу\n\n"
        "Для полегшення симптомів алергії:\n"
        f"{apple_sign}намагатися уникати контакту "
        "з потенційними алергенами,\n"
        f"{apple_sign}проводити елімінаційні заходи "
        "стосовно зовнішніх алергенів:\n"
        f"{checkmark_sign}частіше приймати душ, провітрювати"
        " приміщення,\n"
        f"{checkmark_sign}робити вологе прибирання,\n"
        f"{checkmark_sign}застосовувати гіпоалергенну,"
        " елімінаційну дієту"),
    (ALLERGY_ALLERGENES_CONTACT, "Ні"): (
        DONE,
        "Необхідно звернутися до лікаря "
        "для уточнення діагнозу\n\n"
        "Для тимчасового полегшення симптомів "
        "алергії можна приймати:\n"
        f"{apple_sign}антигістамінні препарати для "
        "системного і місцевого застосування,\n"
        f"{apple_sign}засоби елімінаційної терапії,\n"
        f"{apple_sign}симпатоміметики для"
        " місцевого застосування")
}
transitions_dict['Алергія'] = allergy_dict


# Sore throat states
SORE_THROAT_PRESSURE, SORE_THROAT_REASON,\
    SORE_THROAT_SYMPTOMS, SORE_THROAT_DIABETES = range(5, 9)


sore_throat_dict = {
    (INIT, "Біль у горлі"):
        (SORE_THROAT_PRESSURE,
         "Біль у горлі виник після надмірного тривалого "
         "навантаження на голосові зв'язки або тривалого "
         "перебування у прокуреному приміщенні, "
         "вдиханні хімічних речовин?"),
    (SORE_THROAT_PRESSURE, "Ні"):
        (SORE_THROAT_REASON,
         "Біль у горлі виник:\n\n"
         f"{red_circle_sign}після переохолодження (та/або "
         "контакту з хворим на ГРВІ) і супроводжується "
         "іншими симптомами застуди (головний біль, риніт, "
         "лихоманка, і т.д.),\n"
         f"{red_circle_sign}під час вдихання холодного повітря,\n"
         f"{red_circle_sign}через хронічний тонзиліт"),
    (SORE_THROAT_PRESSURE, "Так"):
        (DONE,
         "Для полегшення стану можна "
         "рекомендувати препарат, який містить "
         "місцевий анестетик"),
    (SORE_THROAT_REASON, "Так"):
        (SORE_THROAT_SYMPTOMS,
         "Чи є у вас скарги на:\n\n"
         f"{red_circle_sign}відчуття болю під час ковтання,\n"
         f"{red_circle_sign}осиплість,\n"
         f"{red_circle_sign}виражене почервоніння горла,\n"
         f"{red_circle_sign}видиме збільшення піднебінних "
         "мигдаликів та поява нальоту на мигдаликах,\n"
         f"{red_circle_sign}припухлість, болісність лімфатичних "
         "вузлів,\n"
         f"{red_circle_sign}супутні шкірні висипання,\n"
         f"{red_circle_sign}появу головного болю, болю у вухах, "
         "животі, грудній клітці,\n"
         f"{red_circle_sign}лихоманку (вище 39 градусів), "
         "різку загальну слабкість, нездужання, блювання,\n"
         f"{red_circle_sign}ви вагітні (жінкам)?"),
    (SORE_THROAT_REASON, "Ні"):
        (DONE,
         "Необхідно звернутися до лікаря "
         "для уточнення діагнозу"),
    (SORE_THROAT_SYMPTOMS, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря "
         "для уточнення діагнозу"),
    (SORE_THROAT_SYMPTOMS, "Ні"):
        (SORE_THROAT_DIABETES,
         "Чи хворієте ви на цукровий діабет?"),
    (SORE_THROAT_DIABETES, "Ні"):
        (DONE,
         "Вам можна рекомендувати препарати для симптоматичного "
         "лікування болю в горлі (таблетки, льодяники для "
         "розсмоктуваання, аерозолі, спреї, розчини та ін.). "
         "Сучасні комплексні препарати на основі "
         "фітонірингових технологій"),
    (SORE_THROAT_DIABETES, "Так"):
        (DONE,
         "Вам можна рекомендувати препарати у спеціальних "
         "лікарських формах для розсмоктування для хворих "
         "із цукровим діабетом, таблетки, аерозолі, спреї, "
         "полоскання без вмісту цукру")

}
transitions_dict['Біль у горлі'] = sore_throat_dict


# Cough states
COUGH_LASTING, COUGH_DRY, COUGH_SMOKING, COUGH_SYMPTOMS,\
    COUGH_SORE_THROAT, COUGH_FLU, COUGH_ITCH, COUGH_IRRITATION = range(9, 17)


cough_dict = {
    (INIT, "Кашель"):
        (COUGH_LASTING,
         "У вас кашель триває більше 3 днів?"),
    (COUGH_LASTING, "Ні"):
        (COUGH_DRY,
         "У вас кашель сухий?"),
    (COUGH_LASTING, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря!"),
    (COUGH_DRY, "Ні"):
        (COUGH_SYMPTOMS,
         "Чи є загрозливі симптоми:\n\n"
         f"{red_circle_sign}інтенсивність кашлю зростає,\n"
         f"{red_circle_sign}висока (вище 38 градусів) температура,\n"
         f"{red_circle_sign}задишка, біль у грудній клітці при диханні,\n"
         f"{red_circle_sign}виділення густого зеленуватого мокротиння,\n"
         f"{red_circle_sign}виділення мокротиння з прожилками крові,\n"
         f"{red_circle_sign}утруднення дихання, напади ядухи"),
    (COUGH_DRY, "Так"):
        (COUGH_SMOKING,
         "Чи ви курите?"),
    (COUGH_SMOKING, "Ні"):
        (COUGH_IRRITATION,
         "Чи мало місце вдихання пилу або подразнюючої "
         "хімічної речовини?"),
    (COUGH_SMOKING, "Так"):
        (DONE,
         "Тютюновий дим подразнює дихальні шляхи та призводить "
         "до розвитку багатьох захворювань. Якщо кашель турбує більше "
         "тижня, необхідно звернутися до лікаря!"),
    (COUGH_IRRITATION, "Так"):
        (DONE,
         "Якщо подібний кашель не зникає протягом години, "
         "необхідно звернутися до лікаря!"),
    (COUGH_IRRITATION, "Ні"):
        (COUGH_FLU,
         "Ви нещодавно хворіли на ГРВІ?"),
    (COUGH_SYMPTOMS, "Ні"):
        (COUGH_SORE_THROAT,
         "Чи є у вас біль у горлі, свербіння у носі, чхання, "
         "закладеність носа?"),
    (COUGH_SYMPTOMS, "Так"):
        (DONE,
         "Необхідно терміново звернутися до лікаря!"),
    (COUGH_SORE_THROAT, "Ні"):
        (COUGH_FLU,
         "Ви нещодавно хворіли на ГРВІ?"),
    (COUGH_SORE_THROAT, "Так"):
        (DONE,
         "Можливо, у вас ГРВІ. Вам показані "
         "постільний режим, вживання теплих напоїв, "
         "прийом протикашльових лікарських засобів. "
         "Для комплексного впливу на патологію кашлю прийміть "
         "комбінований фітоніринговий препарат. Якщо протягом доби "
         "вам не полегшає, необхідно звернутися до лікаря."),
    (COUGH_FLU, "Так"):
        (DONE,
         "Можливо, кашель є проявом залишкових явищ респіраторного "
         "захворювання. Вам показані протикашльові лікарські засоби "
         "центральної або периферійної дії. У зв'язку з тим, "
         "що деякі з них належать до рецептурних, необхідно звернутися "
         "до лікаря. "),
    (COUGH_FLU, "Ні"):
        (COUGH_ITCH,
         "Чи є у вас свербіж шкіри?"),
    (COUGH_ITCH, "Так"):
        (DONE,
         "Можливо, кашель є проявом алергічної реакції"),
    (COUGH_ITCH, "Ні"):
        (DONE,
         "Сухий кашель, який зберігається тривалий час, "
         "може бути симптомом багатьох захворювань. "
         "Необхідно звернутися до лікаря"),
}
transitions_dict["Кашель"] = cough_dict


DIARRHEA_SYMPTOMS, DIARRHEA_DIET, DIARRHEA_MILK, DIARRHEA_CHRONIC_DISEASES, \
    DIARRHEA_STRESS, DIARRHEA_ANTIMICROBIAL_DRUGS,\
    DIARRHEA_MEDICINES = range(17, 24)


diarrhea_dict = {
    (INIT, "Діарея"):
        (DIARRHEA_SYMPTOMS,
         "Який характер мають випорожнення (відмічається зміна кольору - "
         "до чорного і консистенції 'рисового відвару'), мають місце "
         "загрозливі симптоми:\n\n"
         f"{red_circle_sign}діарея триває більше 48 годин,\n"
         f"{red_circle_sign}діарея супроводжується підвищенням "
         f"температури тіла,\n"
         f"{red_circle_sign}виділяється багато слизу та/або "
         f"присутня кров у калі,\n"
         f"{red_circle_sign}часті болісні позиви і болісна дефекація,\n"
         f"{red_circle_sign}діарея супроводжується нудотою і блюванням,\n"
         f"{red_circle_sign}наявні ознаки загального зневоднення: сильна "
         f"спрага, відчуття сухості в роті, зморщена шкіра, знаження ваги "
         f"тіла, значне зменшення кількості сечі,\n"
         f"{red_circle_sign}діарея у вагітних,\n"
         f"{red_circle_sign}діарея у дітей віком до 1 року,\n"
         f"{red_circle_sign}наявність діареї одночасно у декількох членів "
         f"родини"
         ),
    (DIARRHEA_SYMPTOMS, "Так"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування "
         "необхідно звернутися до лікаря"),
    (DIARRHEA_SYMPTOMS, "Ні"):
        (DIARRHEA_DIET,
         "Якого режиму харчування ви дотримуєтеся: чи має місце "
         "переїдання, різка зміна режиму харчування, вживання "
         "продуктів, що викликають посилення перистальтики?"),
    (DIARRHEA_DIET, "Так"):
        (DONE,
         "Дотримання звичного раціону харчування. "
         "Призначити ферментні препарати"),
    (DIARRHEA_DIET, "Ні"):
        (DIARRHEA_MILK,
         "Чи пов'язане нездужання з вживанням "
         "незбираного молока?"),
    (DIARRHEA_MILK, "Так"):
        (DONE,
         "Можливо, діарея пов'язана з нестачею лактози, "
         "необхідні консультація лікаря і виключення з раціону "
         "незбираного молока"),
    (DIARRHEA_MILK, "Ні"):
        (DIARRHEA_CHRONIC_DISEASES,
         "Чи має місце загострення хронічних хвороб шлунково-кишкового "
         "тракту (гіпоацидний гастрит, панкреатит, коліт, холецистит "
         "тощо?)"),
    (DIARRHEA_CHRONIC_DISEASES, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря для лікування основного "
         "захворювання"),
    (DIARRHEA_CHRONIC_DISEASES, "Ні"):
        (DIARRHEA_STRESS,
         "Чи пов'язане нездужання з переляком або стресом?"),
    (DIARRHEA_STRESS, "Так"):
        (DONE,
         "Рекомендовані седативні препарати"),
    (DIARRHEA_STRESS, "Ні"):
        (DIARRHEA_ANTIMICROBIAL_DRUGS,
         "Чи пов'язане нездужання з прийомом "
         "антимікробних препаратів?"),
    (DIARRHEA_ANTIMICROBIAL_DRUGS, "Так"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування "
         "необхідно звернутися до лікаря"),
    (DIARRHEA_ANTIMICROBIAL_DRUGS, "Ні"):
        (DIARRHEA_MEDICINES,
         "Чи пов'язане нездужання з прийомом лікарських засобів - "
         "непрямих антикоагулянтів, нестероїдних протизапальних "
         "препаратів, антацидних засобів, що містять магній, серцевих "
         "глікозидів, препаратів калію, антиаритмічних засобів "
         "(хінідин, пропранолол), замінювачів цукру (ксилітол, "
         "сорбітол)?"),
    (DIARRHEA_MEDICINES, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря для подальшої корекції "
         "лікування"),
    (DIARRHEA_MEDICINES, "Ні"):
        (DONE,
         "Необхідно звернутися до лікаря для подальшої корекції "
         "лікування"),
}
transitions_dict["Діарея"] = diarrhea_dict
