import emoji

red_circle_sign = emoji.emojize(":red_circle:")
apple_sign = emoji.emojize(":green_apple:")
checkmark_sign = emoji.emojize(":round_pushpin:")

# transitions dict - dictionary with all diseases states transition dictionaries
# as values and diseases strings as keys
transitions_dict = {}

# List of all diseases
diseases_list = ["Алергія", "Біль у горлі", "Кашель", "Діарея", "Опік",
                 "Відмова від тютюнопаління", "Поверхнева закрита травма",
                 "Поверхнева відкрита рана", "Стрес", "Підозра на туберкульоз",
                 "Підозра на ВІЛ/СНІД", "Безсоння",
                 "Біль у м'язах", "Біль у спині", "Герпетичне ураження губ",
                 "Головний біль", "Запор", "Короста",
                 "Педикульоз", "Печія", "Підвищення температури тіла",
                 "Остеопороз", "Риніт", "Грип", "Остеоартроз",
                 "Дефіцит йоду", "Вугрова хвороба", "Зубний біль",
                 "Недостатність підшлункової залози",
                 "Порушення функції жовчного міхура",
                 "Захворювання нирок і сечовивідних шляхів",
                 "Клімактеричні розлади", "Контрацепція",
                 "Біль органів травлення та сечових шляхів",
                 "Варикозне розширення вен", "Сечокам'яна хвороба",
                 "Коронавірус"]


# Define done, initial and questioning state
DONE, INIT, QUESTIONING = range(3)


# Allergy states
ALLERGY_SYMPTOMS, ALLERGY_ALLERGENES_CONTACT = range(3, 5)


allergy_dict = {
    (INIT, "Алергія"): (
        ALLERGY_SYMPTOMS,
        "Чи наявні один або декілька симптомів алергії:\n\n"
        f"{red_circle_sign}чхання,\n"
        f"{red_circle_sign}свербіж і почервоніння очей,\n"
        f"{red_circle_sign}водянисті виділення з носа,\n"
        f"{red_circle_sign}шкірні висипи,\n"
        f"{red_circle_sign}шкірний свербіж"),
    (ALLERGY_SYMPTOMS, "Так"): (
        ALLERGY_ALLERGENES_CONTACT,
        "Чи наявний зв'язок симптомів із можливим контактом "
        "з алергенами:\n\n"
        f"{red_circle_sign}домашні тварини, сухий корм для риб,\n"
        f"{red_circle_sign}період цвітіння рослин,\n"
        f"{red_circle_sign}контакт із хімічними речовинами,\n"
        f"{red_circle_sign}прийом лікарських засобів,\n"
        f"{red_circle_sign}уживання деяких продуктів харчування,\n"
        f"{red_circle_sign}укуси комах,\n"
        f"{red_circle_sign}сонячне опромінення, холод"),
    (ALLERGY_SYMPTOMS, "Ні"): (
        DONE,
        "Необхідно звернутися до лікаря для уточнення діагнозу"),
    (ALLERGY_ALLERGENES_CONTACT, "Так"): (
        DONE,
        "Необхідно звернутися до лікаря "
        "для уточнення діагнозу\n\n"
        "Для полегшення симптомів алергії:\n"
        f"{apple_sign}намагатися уникати контакту "
        "з потенційними алергенами,\n"
        f"{apple_sign}проводити елімінаційні заходи "
        "стосовно зовнішніх алергенів:\n"
        f"{checkmark_sign}частіше приймати душ, провітрювати"
        " приміщення,\n"
        f"{checkmark_sign}робити вологе прибирання,\n"
        f"{checkmark_sign}застосовувати гіпоалергенну,"
        " елімінаційну дієту"),
    (ALLERGY_ALLERGENES_CONTACT, "Ні"): (
        DONE,
        "Необхідно звернутися до лікаря "
        "для уточнення діагнозу\n\n"
        "Для тимчасового полегшення симптомів "
        "алергії можна приймати:\n"
        f"{apple_sign}антигістамінні препарати для "
        "системного і місцевого застосування,\n"
        f"{apple_sign}засоби елімінаційної терапії,\n"
        f"{apple_sign}симпатоміметики для"
        " місцевого застосування")
}
transitions_dict['Алергія'] = allergy_dict


# Sore throat states
SORE_THROAT_PRESSURE, SORE_THROAT_REASON,\
    SORE_THROAT_SYMPTOMS, SORE_THROAT_DIABETES = range(5, 9)


sore_throat_dict = {
    (INIT, "Біль у горлі"):
        (SORE_THROAT_PRESSURE,
         "Біль у горлі виник після надмірного тривалого "
         "навантаження на голосові зв'язки або тривалого "
         "перебування у прокуреному приміщенні, "
         "вдиханні хімічних речовин?"),
    (SORE_THROAT_PRESSURE, "Ні"):
        (SORE_THROAT_REASON,
         "Біль у горлі виник:\n\n"
         f"{red_circle_sign}після переохолодження (та/або "
         "контакту з хворим на ГРВІ) і супроводжується "
         "іншими симптомами застуди (головний біль, риніт, "
         "лихоманка, і т.д.),\n"
         f"{red_circle_sign}під час вдихання холодного повітря,\n"
         f"{red_circle_sign}через хронічний тонзиліт"),
    (SORE_THROAT_PRESSURE, "Так"):
        (DONE,
         "Для полегшення стану "
         "рекомендований препарат, який містить "
         "місцевий анестетик"),
    (SORE_THROAT_REASON, "Так"):
        (SORE_THROAT_SYMPTOMS,
         "Чи є у вас скарги на:\n\n"
         f"{red_circle_sign}відчуття болю під час ковтання,\n"
         f"{red_circle_sign}осиплість,\n"
         f"{red_circle_sign}виражене почервоніння горла,\n"
         f"{red_circle_sign}видиме збільшення піднебінних "
         "мигдаликів та поява нальоту на мигдаликах,\n"
         f"{red_circle_sign}припухлість, болісність лімфатичних "
         "вузлів,\n"
         f"{red_circle_sign}супутні шкірні висипання,\n"
         f"{red_circle_sign}появу головного болю, болю у вухах, "
         "животі, грудній клітці,\n"
         f"{red_circle_sign}лихоманку (вище 39 градусів), "
         "різку загальну слабкість, нездужання, блювання,\n"
         f"{red_circle_sign}ви вагітні (жінкам)?"),
    (SORE_THROAT_REASON, "Ні"):
        (DONE,
         "Необхідно звернутися до лікаря "
         "для уточнення діагнозу"),
    (SORE_THROAT_SYMPTOMS, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря "
         "для уточнення діагнозу"),
    (SORE_THROAT_SYMPTOMS, "Ні"):
        (SORE_THROAT_DIABETES,
         "Чи хворієте ви на цукровий діабет?"),
    (SORE_THROAT_DIABETES, "Ні"):
        (DONE,
         "Вам можна рекомендувати препарати для симптоматичного "
         "лікування болю в горлі (таблетки, льодяники для "
         "розсмоктуваання, аерозолі, спреї, розчини та ін.). "
         "Сучасні комплексні препарати на основі "
         "фітонірингових технологій"),
    (SORE_THROAT_DIABETES, "Так"):
        (DONE,
         "Вам можна рекомендувати препарати у спеціальних "
         "лікарських формах для розсмоктування для хворих "
         "із цукровим діабетом, таблетки, аерозолі, спреї, "
         "полоскання без вмісту цукру")

}
transitions_dict['Біль у горлі'] = sore_throat_dict


# Cough states
COUGH_LASTING, COUGH_DRY, COUGH_SMOKING, COUGH_SYMPTOMS,\
    COUGH_SORE_THROAT, COUGH_FLU, COUGH_ITCH, COUGH_IRRITATION = range(9, 17)


cough_dict = {
    (INIT, "Кашель"):
        (COUGH_LASTING,
         "У вас кашель триває більше 3 днів?"),
    (COUGH_LASTING, "Ні"):
        (COUGH_DRY,
         "У вас кашель сухий?"),
    (COUGH_LASTING, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря!"),
    (COUGH_DRY, "Ні"):
        (COUGH_SYMPTOMS,
         "Чи є загрозливі симптоми:\n\n"
         f"{red_circle_sign}інтенсивність кашлю зростає,\n"
         f"{red_circle_sign}висока (вище 38 градусів) температура,\n"
         f"{red_circle_sign}задишка, біль у грудній клітці при диханні,\n"
         f"{red_circle_sign}виділення густого зеленуватого мокротиння,\n"
         f"{red_circle_sign}виділення мокротиння з прожилками крові,\n"
         f"{red_circle_sign}утруднення дихання, напади ядухи"),
    (COUGH_DRY, "Так"):
        (COUGH_SMOKING,
         "Чи ви курите?"),
    (COUGH_SMOKING, "Ні"):
        (COUGH_IRRITATION,
         "Чи мало місце вдихання пилу або подразнюючої "
         "хімічної речовини?"),
    (COUGH_SMOKING, "Так"):
        (DONE,
         "Тютюновий дим подразнює дихальні шляхи та призводить "
         "до розвитку багатьох захворювань. Якщо кашель турбує більше "
         "тижня, необхідно звернутися до лікаря!"),
    (COUGH_IRRITATION, "Так"):
        (DONE,
         "Якщо подібний кашель не зникає протягом години, "
         "необхідно звернутися до лікаря!"),
    (COUGH_IRRITATION, "Ні"):
        (COUGH_FLU,
         "Ви нещодавно хворіли на ГРВІ?"),
    (COUGH_SYMPTOMS, "Ні"):
        (COUGH_SORE_THROAT,
         "Чи є у вас біль у горлі, свербіння у носі, чхання, "
         "закладеність носа?"),
    (COUGH_SYMPTOMS, "Так"):
        (DONE,
         "Необхідно терміново звернутися до лікаря!"),
    (COUGH_SORE_THROAT, "Ні"):
        (COUGH_FLU,
         "Ви нещодавно хворіли на ГРВІ?"),
    (COUGH_SORE_THROAT, "Так"):
        (DONE,
         "Можливо, у вас ГРВІ. Вам показані "
         "постільний режим, вживання теплих напоїв, "
         "прийом протикашльових лікарських засобів. "
         "Для комплексного впливу на патологію кашлю прийміть "
         "комбінований фітоніринговий препарат. Якщо протягом доби "
         "вам не полегшає, необхідно звернутися до лікаря."),
    (COUGH_FLU, "Так"):
        (DONE,
         "Можливо, кашель є проявом залишкових явищ респіраторного "
         "захворювання. Вам показані протикашльові лікарські засоби "
         "центральної або периферійної дії. У зв'язку з тим, "
         "що деякі з них належать до рецептурних, необхідно звернутися "
         "до лікаря. "),
    (COUGH_FLU, "Ні"):
        (COUGH_ITCH,
         "Чи є у вас свербіж шкіри?"),
    (COUGH_ITCH, "Так"):
        (DONE,
         "Можливо, кашель є проявом алергічної реакції"),
    (COUGH_ITCH, "Ні"):
        (DONE,
         "Сухий кашель, який зберігається тривалий час, "
         "може бути симптомом багатьох захворювань. "
         "Необхідно звернутися до лікаря"),
}
transitions_dict["Кашель"] = cough_dict

# Diarrhea states
DIARRHEA_SYMPTOMS, DIARRHEA_DIET, DIARRHEA_MILK, DIARRHEA_CHRONIC_DISEASES, \
    DIARRHEA_STRESS, DIARRHEA_ANTIMICROBIAL_DRUGS,\
    DIARRHEA_MEDICINES = range(17, 24)


diarrhea_dict = {
    (INIT, "Діарея"):
        (DIARRHEA_SYMPTOMS,
         "Який характер мають випорожнення (відмічається зміна кольору - "
         "до чорного і консистенції 'рисового відвару'), мають місце "
         "загрозливі симптоми:\n\n"
         f"{red_circle_sign}діарея триває більше 48 годин,\n"
         f"{red_circle_sign}діарея супроводжується підвищенням "
         f"температури тіла,\n"
         f"{red_circle_sign}виділяється багато слизу та/або "
         f"присутня кров у калі,\n"
         f"{red_circle_sign}часті болісні позиви і болісна дефекація,\n"
         f"{red_circle_sign}діарея супроводжується нудотою і блюванням,\n"
         f"{red_circle_sign}наявні ознаки загального зневоднення: сильна "
         f"спрага, відчуття сухості в роті, зморщена шкіра, знаження ваги "
         f"тіла, значне зменшення кількості сечі,\n"
         f"{red_circle_sign}діарея у вагітних,\n"
         f"{red_circle_sign}діарея у дітей віком до 1 року,\n"
         f"{red_circle_sign}наявність діареї одночасно у декількох членів "
         f"родини"
         ),
    (DIARRHEA_SYMPTOMS, "Так"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування "
         "необхідно звернутися до лікаря"),
    (DIARRHEA_SYMPTOMS, "Ні"):
        (DIARRHEA_DIET,
         "Якого режиму харчування ви дотримуєтеся: чи має місце "
         "переїдання, різка зміна режиму харчування, вживання "
         "продуктів, що викликають посилення перистальтики?"),
    (DIARRHEA_DIET, "Так"):
        (DONE,
         "Дотримання звичного раціону харчування. "
         "Призначити ферментні препарати"),
    (DIARRHEA_DIET, "Ні"):
        (DIARRHEA_MILK,
         "Чи пов'язане нездужання з вживанням "
         "незбираного молока?"),
    (DIARRHEA_MILK, "Так"):
        (DONE,
         "Можливо, діарея пов'язана з нестачею лактози, "
         "необхідні консультація лікаря і виключення з раціону "
         "незбираного молока"),
    (DIARRHEA_MILK, "Ні"):
        (DIARRHEA_CHRONIC_DISEASES,
         "Чи має місце загострення хронічних хвороб шлунково-кишкового "
         "тракту (гіпоацидний гастрит, панкреатит, коліт, холецистит "
         "тощо?)"),
    (DIARRHEA_CHRONIC_DISEASES, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря для лікування основного "
         "захворювання"),
    (DIARRHEA_CHRONIC_DISEASES, "Ні"):
        (DIARRHEA_STRESS,
         "Чи пов'язане нездужання з переляком або стресом?"),
    (DIARRHEA_STRESS, "Так"):
        (DONE,
         "Рекомендовані седативні препарати"),
    (DIARRHEA_STRESS, "Ні"):
        (DIARRHEA_ANTIMICROBIAL_DRUGS,
         "Чи пов'язане нездужання з прийомом "
         "антимікробних препаратів?"),
    (DIARRHEA_ANTIMICROBIAL_DRUGS, "Так"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування "
         "необхідно звернутися до лікаря"),
    (DIARRHEA_ANTIMICROBIAL_DRUGS, "Ні"):
        (DIARRHEA_MEDICINES,
         "Чи пов'язане нездужання з прийомом лікарських засобів - "
         "непрямих антикоагулянтів, нестероїдних протизапальних "
         "препаратів, антацидних засобів, що містять магній, серцевих "
         "глікозидів, препаратів калію, антиаритмічних засобів "
         "(хінідин, пропранолол), замінювачів цукру (ксилітол, "
         "сорбітол)?"),
    (DIARRHEA_MEDICINES, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря для подальшої корекції "
         "лікування"),
    (DIARRHEA_MEDICINES, "Ні"):
        (DONE,
         "Необхідно звернутися до лікаря для подальшої корекції "
         "лікування"),
}
transitions_dict["Діарея"] = diarrhea_dict

# Burn states
BURN_SELFCARE, BURN_SUPERFICIAL, BURN_THERMAL,\
    BURN_CHEMICAL, BURN_DURATION = range(24, 29)

burn_dict = {
    (INIT, "Опік"): (BURN_SELFCARE,
                     "Чи проводились заходи самодопомоги?"),
    (BURN_SELFCARE, "Так"): (BURN_SUPERFICIAL,
                             "Опіки поверхневі і займають "
                             "невеликі ділянки тіла?"),
    (BURN_SELFCARE, "Ні"): (DONE,
                            "При термічних опіках необхідно після "
                            "припинення дії термічного агента охолодити "
                            "уражену ділянку (холодною водою, снігом, тощо), "
                            "вжити заходів для запобігання забрудненню "
                            "опікової поверхні і захисту її від інфікування. "
                            "При хімічних опіках уражену шкіру і слизові "
                            "необхідно промити великою кількістю холодної "
                            "води, а потім провести хімічну нейтралізацію "
                            "відповідно до хімічних властивостей агента"),
    (BURN_SUPERFICIAL, "Так"): (BURN_THERMAL,
                                "Опік термічний або сонячний?"),
    (BURN_SUPERFICIAL, "Ні"): (DONE,
                               "Необхідно звернутися до лікаря "
                               "для надання допомоги і призначення "
                               "лікування"),
    (BURN_THERMAL, "Так"): (BURN_DURATION,
                            "Опік отримано впродовж доби?"),
    (BURN_THERMAL, "Ні"): (BURN_CHEMICAL,
                           "Опік викликаний хімічним агентом?"),
    (BURN_CHEMICAL, "Так"): (DONE,
                             "Необхідно звернутися до лікаря "
                             "для надання допомоги  і призначення "
                             "лікування. "
                             "Якщо неможливо звернутися до лікаря "
                             "негайно, вжити заходів щодо усунення "
                             "і нейтралізації хімічного агента, "
                             "який викликав опік"),
    (BURN_CHEMICAL, "Ні"): (DONE,
                            "Необхідно звернутися до лікаря "
                            "для надання допомоги  і призначення "
                            "лікування"),
    (BURN_DURATION, "Так"): (DONE,
                             "При легкому ступені опіку після "
                             "проведення первинних запобіжних заходів "
                             "необхідно обробити уражену ділянку "
                             "антисептичними засобами і нанести лікарські "
                             "засоби ранозагоювальної й антибактеріальної "
                             "дії для топічного застосування"),
    (BURN_DURATION, "Ні"): (DONE,
                            "При легкому ступені опіку рекомендовано "
                            "лікарські засоби ранозагоювальної дії для "
                            "топічного застосування, при ознаках "
                            "погіршення стану (наявності гною, почервоніння "
                            "і набряку прилеглих ділянок шкіри, підвищенні "
                            "температури тіла тощо) терміново звернутися "
                            "до лікаря")
}
transitions_dict["Опік"] = burn_dict

# Smoking states
SMOKING_WILL, SMOKING_CARDIO, SMOKING_MEDICINE,\
    SMOKING_SYMPTOMS = range(29, 33)

smoking_dict = {
    (INIT, "Відмова від тютюнопаління"): (SMOKING_WILL,
                                          "Чи зумовлена відмова від паління "
                                          "звичайним бажанням кинути палити?"),
    (SMOKING_WILL, "Так"): (DONE,
                            "Призначити безрецептурні лікарські засоби, "
                            "що допомагають кинути курити"),
    (SMOKING_WILL, "Ні"): (SMOKING_CARDIO,
                           "Чи зумовлена відмова від паління наявністю "
                           "серцево-судинних захворювань (в т.ч. в "
                           "анамнезі інсульт, інфаркт міокарда), цукрового "
                           "діабету, виразкової хвороби шлунка та "
                           "дванадцятипалої кишки, захворювання органів "
                           "дихання, онкологічних захворювань, тощо?"),
    (SMOKING_CARDIO, "Так"): (DONE,
                              "Необхідно звернутися до лікаря для "
                              "призначення лікування залежності від "
                              "тютюнокуріння"),
    (SMOKING_CARDIO, "Ні"): (SMOKING_MEDICINE,
                             "Чи приймає/приймав пацієнт лікарські засоби, "
                             "що допомагають кинути курити?"),
    (SMOKING_MEDICINE, "Так"): (DONE,
                                "Продовжити прийом лікарських "
                                "засобів, що допомагають кинути "
                                "курити, якщо ефект лікування задовільний. "
                                "Якщо ефект незадовільний - необхідно "
                                "звернутися до лікаря"),
    (SMOKING_MEDICINE, "Ні"): (SMOKING_SYMPTOMS,
                               "Чи наявні ознаки вираженого синдрому "
                               "відміни під час лікуваання тютюнозалежності: "
                               "\n\n"
                               f"{red_circle_sign}дратівливість,\n"
                               f"{red_circle_sign}запаморочення/"
                               f"головний біль,\n"
                               f"{red_circle_sign}тривога/депресія,\n"
                               f"{red_circle_sign}труднощі в "
                               f"концентрації уваги,\n"
                               f"{red_circle_sign}підвищене потовиділення,\n"
                               f"{red_circle_sign}безсоння,\n"
                               f"{red_circle_sign}розлади шлунково-кишкового "
                               f"тракту"),
    (SMOKING_SYMPTOMS, "Так"): (DONE,
                                "Необхідно звернутися до лікаря для "
                                "уточнення діагнозу. Для тимчасового "
                                "зменшення проявів наявних симптомів "
                                "рекомендовані безрецептурні лікарські "
                                "препарати відповідної дії:\n\n"
                                f"{red_circle_sign}седативні\n"
                                f"{red_circle_sign}снодійні\n"
                                f"{red_circle_sign}антидепресанти\n"
                                f"{red_circle_sign}амінокислоти\n"
                                "Надати рекомендації щодо здорового способу "
                                "життя під час лікування тютюнозалежності"),
    (SMOKING_SYMPTOMS, "Ні"): (DONE,
                               "Можна рекомендувати безрецептурні "
                               "лікарські засоби, що допомагають кинути "
                               "курити")
}
transitions_dict["Відмова від тютюнопаління"] = smoking_dict

# Closed injury states
CLOSED_INJURY_SYMPTOMS, CLOSED_INJURY_DURATION, CLOSED_INJURY_RECOVERY =\
    range(33, 36)

closed_injury_dict = {
    (INIT, "Поверхнева закрита травма"):
        (CLOSED_INJURY_SYMPTOMS,
         "Чи мають місце загрозливі симптоми:\n\n"
         f"У травмованій ділянці тіла при незначному фізичному навантаженні "
         f"{red_circle_sign}з'являється різкий біль у поєднанні із обмеженням "
         f"руху в суглобі,\n"
         f"{red_circle_sign}швидке, (протягом кількох хвилин) наростання "
         f"набряку ушкоджених тканин, поява синюшного відтінку,\n"
         f"{red_circle_sign}після перенесеної місцевої травми відмічаються "
         f"нудота, запаморочення, сонливість,\n"
         f"{red_circle_sign}у місці пошкодження наявна кровотеча,\n"
         f"{red_circle_sign}після перенесеної травми відмічається підвищення "
         f"температури тіла вище 38 градусів,\n"
         f"{red_circle_sign}ознаки наслідків удару "
         f"(біль, набряк, синець тощо) з'явилися без травмування,\n"
         f"{red_circle_sign}ви вагітні (жінкам)?"),
    (CLOSED_INJURY_SYMPTOMS, "Так"):
        (DONE, "Необхідно терміново звернутися до лікаря"),
    (CLOSED_INJURY_SYMPTOMS, "Ні"):
        (CLOSED_INJURY_DURATION, "Чи травмування мало місце нещодавно?"),
    (CLOSED_INJURY_DURATION, "Так"):
        (DONE, "Якщо ушкодження незначне, потрібно протягом перших "
               "24-48 годин забезпечити спокій і холод на місце ушкодження, "
               "при необхідності призначити лікарські засоби симптоматичної "
               "дії для місцевого застосування, для зняття сильного болю "
               "призначити анальгетики"),
    (CLOSED_INJURY_DURATION, "Ні"):
        (CLOSED_INJURY_RECOVERY, "Чи нормально, без ускладнень проходить "
                                 "процес загоєння травмованої ділянки тіла "
                                 "після надання першої допомоги (у випадку "
                                 "травмування більше 2-х діб тому)?"),
    (CLOSED_INJURY_RECOVERY, "Так"):
        (DONE, "Для прискорення процесу одужання продовжити терапію "
               "лікарськими засобами, які мають протизапальну і "
               "анальгетичну дію"),
    (CLOSED_INJURY_RECOVERY, "Ні"):
        (DONE, "Необхідно звернутися до лікаря для призначення "
               "лікування при ознаках погіршення стану (наявності гною, "
               "почервоніння і набряку прилеглих ділянок шкіри, підвищення "
               "температури тіла тощо)")
}

transitions_dict["Поверхнева закрита травма"] = closed_injury_dict

# Open wound states
OPEN_WOUND_SYMPTOMS, OPEN_WOUND_DURATION, OPEN_WOUND_PRIMARY_CARE, \
    OPEN_WOUND_RECOVERY = range(36, 40)

open_wound_dict = {
    (INIT, "Поверхнева відкрита рана"):
        (OPEN_WOUND_SYMPTOMS,
         "Чи мають місце загрозливі симптоми:\n\n"
         f"{red_circle_sign}кровотеча яксраво-червоного кольору, кров "
         f"витікає із рани під тиском (пульсуюча кровотеча) - "
         f"можливе пошкодження артерії,\n"
         f"{red_circle_sign}сильна кровотеча, яка супроводжується великою "
         f"втратою крові,\n"
         f"{red_circle_sign}якщо поріз глибокий або довжиною більше 2 см - "
         f"можливо, знадобиться накладання швів,\n"
         f"{red_circle_sign}кровотеча не припиняється через 15 - 20 "
         f"хвилин після накладання пов'язки,\n"
         f"{red_circle_sign}поріз або подряпина на обличчі або в іншому "
         f"місці, де утворення шраму необхідно звести до мінімуму,\n"
         f"{red_circle_sign}поріз на кисті або зап'ястку - можливе "
         f"пошкодження нервів або сухожилля,\n"
         f"{red_circle_sign}наявні ознаки запалення - червоні смуги, "
         f"почервоніння, що розповсюджується більш ніж на 2 см навколо "
         f"рани, набряк навколо рани, температура,\n"
         f"{red_circle_sign}рана супроводжується підвищенням температури "
         f"тіла,\n"
         f"{red_circle_sign}забруднення рани якщо вам робили протиправцеве "
         f"щеплення більше 5 років тому,\n"
         f"{red_circle_sign}рану неможливо добре очистити і вимити від "
         f"бруду,\n"
         f"{red_circle_sign}рана, із якої виділяється багато ексудату і "
         f"яка довго не загоюється,\n"
         f"{red_circle_sign}рана супроводжується нудотою і блюванням, "
         f"особливо при травмах голови,\n"
         f"{red_circle_sign}будь-які рани і порізи на обличчі і голові "
         f"у дітей,\n"
         f"{red_circle_sign}якщо кровотеча, що виникла у дитини при "
         f"травмуванні гострим предметом внутрішніх ділянок рота чи губи, "
         f"не минає протягом 15 хвилин?\n"),
    (OPEN_WOUND_SYMPTOMS, "Так"):
        (DONE, "Необхідно терміново звернутися до лікаря"),
    (OPEN_WOUND_SYMPTOMS, "Ні"):
        (OPEN_WOUND_DURATION, "Чи травмування мало місце нещодавно?"),
    (OPEN_WOUND_DURATION, "Так"):
        (OPEN_WOUND_PRIMARY_CARE, "Чи були вжиті заходи першої допомоги "
                                  "після травмування/порізу?"),
    (OPEN_WOUND_DURATION, "Ні"):
        (OPEN_WOUND_RECOVERY, "Чи нормально, без ускладнень відбувається "
                              "загоєння рани після надання першої допомоги "
                              "(якщо травмування мало місце деякий "
                              "час тому)?"),
    (OPEN_WOUND_PRIMARY_CARE, "Так"):
        (DONE,
         "Якщо обробка рани проведена належним чином, рекомендовані "
         "за необхідності лікарські засоби для прискорення загоєння рани:\n\n"
         f"{red_circle_sign}антисептичні і дезинфікуючі засоби,\n"
         f"{red_circle_sign}антибактеріальні засоби для "
         f"топічного застосування,\n"
         f"{red_circle_sign}ранозагоювальні засоби для "
         f"топічного застосування"),
    (OPEN_WOUND_PRIMARY_CARE, "Ні"):
        (DONE,
         "Невеликі подряпини і порізи потрібно промити водними розчинами "
         "антисептиків або, за їх відсутності, чистою воою з милом і "
         "накласти стерильну пов'язку з антисептиком. Якщо наявна кровотеча, "
         "її необхідно спинити шляхом накладання пов'язки або джгута. "
         "У випадку серйозного травмування необхідно звернутися до лікаря"),
    (OPEN_WOUND_RECOVERY, "Так"):
        (DONE, "Для прискорення процесу загоєння рани можна призначити "
               "ранозагоювальні засоби для топічного застосування"),
    (OPEN_WOUND_RECOVERY, "Ні"):
        (DONE, "Необхідно звернутися до лікаря для призначення лікування")
}

transitions_dict["Поверхнева відкрита рана"] = open_wound_dict

# Stress states
STRESS_CHRONICAL_DISEASES, STRESS_SYMPTOMS,\
    STRESS_SYMPTOMS_REASON, STRESS_MEDICINES = range(40, 44)

stress_dict = {
    (INIT, "Стрес"):
        (STRESS_CHRONICAL_DISEASES,
         "Чи наявні на фоні стресу загострення хронічних "
         "захворювань бронхіальної астми, хронічного гастриту, "
         "виразкової хвороби шлунка і дванадцятипалої кишки, "
         "серцево-судинних захворювань, гіпертонічної хвороби, "
         "тощо?"),
    (STRESS_CHRONICAL_DISEASES, "Так"):
        (DONE, "Необхідно звернутися до лікаря для призначення лікування"),
    (STRESS_CHRONICAL_DISEASES, "Ні"):
        (STRESS_SYMPTOMS, "Чи наявні такі симптоми:\n\n"
                          f"{red_circle_sign}втома, млявість,\n"
                          f"{red_circle_sign}роздратованість,\n"
                          f"{red_circle_sign}зниження концентрації уваги,\n"
                          f"{red_circle_sign}безсоння,\n"
                          f"{red_circle_sign}депресія, апатія,\n"
                          f"{red_circle_sign}агресивність?"),
    (STRESS_SYMPTOMS, "Так"):
        (STRESS_SYMPTOMS_REASON,
         "Чи з'явились ці симптоми після:\n\n"
         f"{red_circle_sign}нервово-емоційного "
         f"перенавантаження (страх, сильне нервове "
         f"потрясіння, дефіцит часу, складності "
         f"у взаємовідносинах у сім'ї, на роботі),\n"
         f"{red_circle_sign}фізичного навантаження,\n"
         f"{red_circle_sign}недотримання режиму праці і відпочинку "
         f"(порушення режиму сну, незбалансоване харчування, часта зміна "
         f"часових поясів тощо)?"),
    (STRESS_SYMPTOMS, "Ні"):
        (DONE, "Необхідно звернутися до лікаря для уточнення діагнозу"),
    (STRESS_SYMPTOMS_REASON, "Так"):
        (DONE,
         "Необхідно зменшити по можливості вплив стресових факторів. "
         "Для зменшення проявів наявних симптомів рекомендовані "
         "безрецептурні препарати відповідної дії - седативні, "
         "снодійні, анксіолітики, антидепресанти "
         "(рослинного походження). Більше гуляйте на свіжому повітрі, "
         "обмежте або краще на деякий час взагалі відмовтеся від "
         "медіа і соціальних мереж, медитуйте, читайте книги в "
         "задоволення, займіться спортом."),
    (STRESS_SYMPTOMS_REASON, "Ні"):
        (STRESS_MEDICINES,
         "Чи має місце прийом лікарських засобів:\n\n"
         f"{red_circle_sign}симпатоміметиків (препаратів для лікування "
         f"бронхіальної астми, риніту),\n"
         f"{red_circle_sign}гормонів щитоподібної залози,\n"
         f"{red_circle_sign}препаратів, що містять кофеїн,\n"
         f"{red_circle_sign}загальнотонізуючих засобів або має місце "
         f"синдром відміни снодійних, транквілізаторів, "
         f"нікотину, алкоголю?"),
    (STRESS_MEDICINES, "Так"):
        (DONE, "Необхідно звернутися до лікаря, оскільки стан "
               "може бути пов'язаний з прийомом/відміною лікарських "
               "засобів"),
    (STRESS_MEDICINES, "Ні"):
        (DONE, "Необхідно звернутися до лікаря для уточнення діагнозу")
}
transitions_dict["Стрес"] = stress_dict

# Tuberculosis suspect states
TUBERCULOSIS_SUSPECT_SYMPTOMS, TUBERCULOSIS_SUSPECT_DIAGNOSIS,\
    TUBERCULOSIS_SUSPECT_MEDICINES = range(44, 47)

tuberculosis_suspect_dict = {
    (INIT, "Підозра на туберкульоз"):
        (TUBERCULOSIS_SUSPECT_SYMPTOMS,
         "Чи наявні у пацієнта симптоми, за якими можна запідозрити "
         "туберкульоз:\n\n"
         f"{red_circle_sign}стійкий продуктивний кашель тривалістю понад "
         f"два тижні,\n"
         f"{red_circle_sign}фебрильна або субфебрильна температураа тіла,\n"
         f"{red_circle_sign}нічна пітливість,\n"
         f"{red_circle_sign}втрата ваги, відсутність апетиту,\n"
         f"{red_circle_sign}важка задишка, ускладнене дихання, приступи "
         f"ядухи, захриплість голосу,\n"
         f"{red_circle_sign}кровохаркання, легенева кровотеча,\n"
         f"{red_circle_sign}виражений інтоксикаційний синдром, "
         f"слабкість,\n"
         f"{red_circle_sign}виражений біль у грудній клітці, що пов'язаний "
         f"з актом дихання,\n"
         f"{red_circle_sign}локальний біль у кістках та суглобах"
         ),
    (TUBERCULOSIS_SUSPECT_SYMPTOMS, "Так"):
        (DONE,
         "Необхідно терміново звернутися до лікаря для діагностики, "
         "уточнення діагнозу та призначення лікування"),
    (TUBERCULOSIS_SUSPECT_SYMPTOMS, "Ні"):
        (TUBERCULOSIS_SUSPECT_DIAGNOSIS,
         "Діагноз захворювання визначив лікар?"),
    (TUBERCULOSIS_SUSPECT_DIAGNOSIS, "Так"):
        (TUBERCULOSIS_SUSPECT_MEDICINES,
         "Чи приймає пацієнт з підозрою/захворюванням на "
         "туберкульоз протитуберкульозні лікарські засоби?"),
    (TUBERCULOSIS_SUSPECT_DIAGNOSIS, "Ні"):
        (DONE,
         "Необхідно звернутись до лікаря для уточнення діагнозу "
         "і призначення лікування"),
    (TUBERCULOSIS_SUSPECT_MEDICINES, "Так"):
        (DONE,
         "Рекомендовано продовжити прийом протитуберкульозних лікарських "
         "засобів з ознайомленням з можливими побічними реакціями, "
         "особливостями застосування протитуберкульозних лікарських засобів. "
         "Суворо дотримуватися безперервного лікування протягом усього "
         "терміну, встановленого лікарем, навіть тоді, коли пацієнт "
         "відмічає покращення стану здоров'я, у зв'язку з можливим "
         "розвитком хіміорезистентності"),
    (TUBERCULOSIS_SUSPECT_MEDICINES, "Ні"):
        (DONE,
         "Необхідно звернутися до лікаря для уточнення діагнозу "
         "і призначення лікування")
}
transitions_dict["Підозра на туберкульоз"] = tuberculosis_suspect_dict

# HIV/AIDS suspect states
HIV_AIDS_SUSPECT_SYMPTOMS = 47
hiv_aids_suspect_dict = {
    (INIT, "Підозра на ВІЛ/СНІД"):
        (HIV_AIDS_SUSPECT_SYMPTOMS,
         "Чи наявні у пацієнта загрозливі симптоми, які характерні "
         "при підозрі/захворюванні на ВІЛ/СНІД:\n\n"
         f"{red_circle_sign}немотивована втрата ваги,\n"
         f"{red_circle_sign}немотивована хронічна діарея, "
         f"яка триває більше місяця,\n"
         f"{red_circle_sign}немотивоване підвищення температури тіла, "
         f"яке триває більше 1 місяця (постійно або періодично),\n"
         f"{red_circle_sign}ураження шкіри та слизових оболонок "
         f"(себорейний дерматит, грибкові ураження нігтів, "
         f"рецидивуючі виразки слизової оболонки ротової порожнини, "
         f"кандидоз ротової порожнини (молочниця),\n"
         f"{red_circle_sign}нічна пітливість,\n"
         f"{red_circle_sign}виражений інтоксикаційний синдром, "
         f"слабкість,\n"
         f"{red_circle_sign}часті вірусні захворювання,\n"
         f"{red_circle_sign}герпетична інфекція з хронічними "
         f"виразками, що не виліковуються протягом одного місяця,\n"
         f"{red_circle_sign}епізод оперізуючого лишаю протягом останніх "
         f"п'яти років,\n"
         f"{red_circle_sign}важкі тривалі пневмонії,\n"
         f"{red_circle_sign}легеневий туберкульоз, що розвинувся протягом "
         f"року"
         ),
    (HIV_AIDS_SUSPECT_SYMPTOMS, "Так"):
        (DONE, "Необхідно терміново звернутися до лікаря для діагностики, "
               "уточнення діагнозу та призначення лікування"),
    (HIV_AIDS_SUSPECT_SYMPTOMS, "Ні"):
        (DONE, "Необхідно звернутися до лікаря для уточнення діагнозу. "
               "Для тимчасового полегшення симптомів призначити симптоматичне "
               "лікування залежно від характеру скарг пацієнта")
}
transitions_dict["Підозра на ВІЛ/СНІД"] = hiv_aids_suspect_dict

# Insomnia states
INSOMNIA_SYMPTOMS, INSOMNIA_MEDICINES, \
    INSOMNIA_CHRONICAL_DISEASES, INSOMNIA_REASON = range(48, 52)

insomnia_dict = {
    (INIT, "Безсоння"):
        (INSOMNIA_SYMPTOMS,
         "Чи наявні у пацієнта один або декілька загрозливих симптомів:\n\n"
         f"{red_circle_sign}довготривале (більше 2 тижнів) порушення сну,\n"
         f"{red_circle_sign}повна відсутність сну понад 2 доби,\n"
         f"{red_circle_sign}порушення сну супроводжується підвищенням "
         f"артеріального тиску, сильним головним болем, запамороченням, "
         f"втратою свідомості, болем за грудиною, що іррадіює в ліву "
         f"половину тіла, прискоренним серцебиттям,\n"
         f"{red_circle_sign}безсоння супроводжується відчуттям жару, "
         f"пітливістю, сухістю в роті, судомами,\n"
         f"{red_circle_sign}важке засинання і часті пробудження, викликані "
         f"необхідністю відвідування туалету"
         ),
    (INSOMNIA_SYMPTOMS, "Так"):
        (DONE, "Для уточнення лікування і призначення лікування "
               "необхідно звернутися до лікаря"),
    (INSOMNIA_SYMPTOMS, "Ні"):
        (INSOMNIA_MEDICINES,
         "Чи має місце прийом деяких лікарських засобів:\n\n"
         f"{red_circle_sign}глюкокортикоїдів,\n"
         f"{red_circle_sign}тиреоїдних гормонів,\n"
         f"{red_circle_sign}симпатоміметиків,\n"
         f"{red_circle_sign}антиаритмічних,\n"
         f"{red_circle_sign}гіполіпідемічних,\n"
         f"{red_circle_sign}адаптогенів,\n"
         f"{red_circle_sign}седативних,\n"
         f"{red_circle_sign}вітамінів"),
    (INSOMNIA_MEDICINES, "Так"):
        (DONE, "Необхідно звернутися до лікаря для корекції лікування, "
               "оскільки безсоння може бути пов'язане з прийомом лікарських "
               "засобів"),
    (INSOMNIA_MEDICINES, "Ні"):
        (INSOMNIA_CHRONICAL_DISEASES,
         "Чи наявні у пацієнта хронічні захворювання, при яких може "
         "виникати порушення сну:\n\n"
         f"{red_circle_sign}травного тракту,\n"
         f"{red_circle_sign}психічні захворювання, особливо такі, що "
         f"супроводжуються депресивними станами,\n"
         f"{red_circle_sign}дихальної системи,\n"
         f"{red_circle_sign}серцево-судинної системи,\n"
         f"{red_circle_sign}ендокринної системи,\n"
         f"{red_circle_sign}м'язів та суглобів,\n"
         f"{red_circle_sign}інфекційні захворювання,\n"
         f"{red_circle_sign}синдром обструктивних сонних апное,\n"
         f"{red_circle_sign}ураження головного мозку унаслідок травми "
         f"або енцефаліту,\n"
         f"{red_circle_sign}період менопаузи у жінок,\n"
         f"{red_circle_sign}період вагітності (особливо третій триместр)"),
    (INSOMNIA_CHRONICAL_DISEASES, "Так"):
        (DONE, "Для призначення лікування необхідно звернутися до лікаря. "
               "Для тимчасового полегшення стану рекомендовані снодійні "
               "та седативні засоби"),
    (INSOMNIA_CHRONICAL_DISEASES, "Ні"):
        (INSOMNIA_REASON,
         "Чи мають місце фактори, які можуть сприяти виникненню порушень "
         "сну:\n\n"
         f"{red_circle_sign}стрес, емоційне перевантаження,\n"
         f"{red_circle_sign}робота у нічну зміну,\n"
         f"{red_circle_sign}швидка зміна часових поясів,\n"
         f"{red_circle_sign}зловживання психоактивними речовинами "
         f"(алкоголь, кофеїн, нікотин, психостимулятори, наркотики),\n"
         f"{red_circle_sign}порушення гігієни сну (прийом важкої "
         f"їжі незадовго до сну, нерегулярний розпорядок сну, незадовільні "
         f"умови сну, гіподинамія (малорухливість), тощо),\n"
         f"{red_circle_sign}старечий вік (після 60-70 років)"
         ),
    (INSOMNIA_REASON, "Так"):
        (DONE, "Необхідно правильно організувати умови праці та "
               "відпочинку, змінити режим харчування, не переїдати "
               "перед сном, відмовитися від психоактивних речовин "
               "перечислених вище. Іноді цього достатньо для усунення "
               "проблем зі сном. Для тимчасового полегшення стану "
               "рекомендовані снодійні та седативні засоби"),
    (INSOMNIA_REASON, "Ні"):
        (DONE, "Для уточненн діагнозу і призначення лікування необхідно "
               "звернутися до лікаря. Для тимчасового полегшення стану "
               "рекомендовані снодійні та седативні засоби")
}

transitions_dict["Безсоння"] = insomnia_dict

# Muscle pain states
MUSCLE_PAIN_SYMPTOMS, MUSCLE_PAIN_INJURY, MUSCLE_PAIN_FLU,\
    MUSCLE_PAIN_MEDICINES, MUSCLE_PAIN_PHYSICAL_ACTIVITY = range(52, 57)

muscle_pain_dict = {
    (INIT, "Біль у м'язах"):
        (MUSCLE_PAIN_SYMPTOMS,
         "Чи наявні у пацієнта загрозливі симптоми:\n\n"
         f"{red_circle_sign}підвищення температури тіла за відсутності "
         f"інших симптомів ГРВІ,\n"
         f"{red_circle_sign}біль у ділянці шиї, плечового поясу, грудної "
         f"клітки, а також задишка,\n"
         f"{red_circle_sign}біль у литкових м'язах,\n"
         f"{red_circle_sign}ви вагітні? (для жінок)"
         ),
    (MUSCLE_PAIN_SYMPTOMS, "Так"):
        (DONE, "Для уточнення діагнозу і призначення лікування "
               "необхідно звернутися до лікаря"),
    (MUSCLE_PAIN_SYMPTOMS, "Ні"):
        (MUSCLE_PAIN_INJURY,
         "Біль виник внаслідок травмування?"),
    (MUSCLE_PAIN_INJURY, "Так"):
        (DONE,
         "Необхідно протягом перших 24 - 48 годин забезпечити спокій "
         "і холод на місце ушкодження, якщо ушкодження незначне. "
         "За необхідності порекомендувати засоби симптоматичної "
         "дії для місцевого застосування, для зняття сильного болю "
         "рекомендовані анальгетики"),
    (MUSCLE_PAIN_INJURY, "Ні"):
        (MUSCLE_PAIN_FLU,
         "Чи наявні один або декілька симптомів гострого "
         "респіраторного захворювання:\n\n"
         f"{red_circle_sign}підвищена температура тіла,\n"
         f"{red_circle_sign}кашель,\n"
         f"{red_circle_sign}біль у горлі,\n"
         f"{red_circle_sign}біль у м'язах,\n"
         f"{red_circle_sign}головний біль"),
    (MUSCLE_PAIN_FLU, "Так"):
        (DONE,
         "Необхідно лікувати основне захворювання. Для тимчасового "
         "полегшення симптомів гострого респіраторного захворювання "
         "рекомендовані комбіновані лікарські засоби, які містять "
         "анальгетики та антипіретики"),
    (MUSCLE_PAIN_FLU, "Ні"):
        (MUSCLE_PAIN_MEDICINES,
         "Чи має місце прийом деяких лікарських засобів:\n\n"
         f"{red_circle_sign}діуретиків,\n"
         f"{red_circle_sign}антигіпертензивних засобів,\n"
         f"{red_circle_sign}препаратів кальцію,\n"
         f"{red_circle_sign}препаратів вітаміну D"),
    (MUSCLE_PAIN_MEDICINES, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря для корекції лікування, "
         "оскільки біль у м'язах може бути пов'язаний з прийомом ліків"),
    (MUSCLE_PAIN_MEDICINES, "Ні"):
        (MUSCLE_PAIN_PHYSICAL_ACTIVITY,
         "Чи було значне фізичне навантаження або переохолодження?"),
    (MUSCLE_PAIN_PHYSICAL_ACTIVITY, "Так"):
        (DONE,
         "Для полегшення стану рекомендовані анальгетики або нестероїдні "
         "протизапальні препарати системної або місцевої дії, якщо "
         "через 2-3 доби стан пацієнта не покращиться, необхідно "
         "звернутися до лікаря"),
    (MUSCLE_PAIN_PHYSICAL_ACTIVITY, "Ні"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування необхідно "
         "звернутися до лікаря. Для тимчачового полегшення стану "
         "призначити анальгетики або нестероїдні протизапальні засоби "
         "системної або місцевої дії")
}

transitions_dict["Біль у м'язах"] = muscle_pain_dict

# Back pain states
BACK_PAIN_SYMPTOMS, BACK_PAIN_POSES, BACK_PAIN_INJURY = range(57, 60)

back_pain_dict = {
    (INIT, "Біль у спині"):
        (BACK_PAIN_SYMPTOMS,
         "Чи наявні у пацієнта загрозливі симптоми:\n\n"
         f"{red_circle_sign}біль у спині супроводжується онімінням "
         f"(порушенням чутливості) однієї або обох кінцівок, "
         f"ослабленням їх м'язової сили,\n"
         f"{red_circle_sign}біль у спині має характер прострілу, "
         f"супроводжується судомами, посилюється при кашлі або "
         f"чханні,\n"
         f"{red_circle_sign}гострий біль у спині супроводжується болями "
         f"в грудній клітці та іррадіює під лопатку,\n"
         f"{red_circle_sign}гострий біль у спині супроводжується "
         f"підвищенням температури тіла,\n"
         f"{red_circle_sign}гострий біль у спині супроводжується "
         f"порушенням сечовиділення,\n"
         f"{red_circle_sign}біль у спині триває більше 5-7 діб та іррадіює "
         f"в ногу,\n"
         f"{red_circle_sign}ви вагітні (для жінок)?"),
    (BACK_PAIN_SYMPTOMS, "Так"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування необхідно "
         "звернутися до лікаря"),
    (BACK_PAIN_SYMPTOMS, "Ні"):
        (BACK_PAIN_POSES,
         "Чи наявні у пацієнта стани, при яких може виникати біль "
         "у спині:\n\n"
         f"{red_circle_sign}неправильна осанка або сколіоз,\n"
         f"{red_circle_sign}остеохондроз,\n"
         f"{red_circle_sign}остеопороз,\n"
         f"{red_circle_sign}надлишкова маса тіла,\n"
         f"{red_circle_sign}недостатня фізична активність,\n"
         f"{red_circle_sign}переохолодження,\n"
         f"{red_circle_sign}фізичне навантаження у положенні "
         f"з нахилом тулуба вперед,\n"
         f"{red_circle_sign}перебування у незручному положенні,"
         ),
    (BACK_PAIN_POSES, "Так"):
        (DONE,
         "Для призначення лікування необхідно звернутися до лікаря. "
         "Для тимчасового полегшення стану рекомендовані анальгетики "
         "або нестероїдні протизапальні препарати системної або місцевої дії"),
    (BACK_PAIN_POSES, "Ні"):
        (BACK_PAIN_INJURY,
         "Біль виник внаслідок травмування?"),
    (BACK_PAIN_INJURY, "Так"):
        (DONE,
         "Для призначення лікування потрібно звернутися до лікаря. "
         "Для тимчасового полегшення стану рекомендовані анальгетики "
         "або нестероїдні протизапальні препарати системної або місцевої "
         "дії"),
    (BACK_PAIN_INJURY, "Ні"):
        (DONE,
         "Для полегшення стану рекомендовані анальгетики або нестероїдні "
         "протизапальні препарати системної або місцевої дії. Якщо "
         "через 2-3 доби стан пацієнта не покращиться, необхідно звернутися "
         "до лікаря")
}

transitions_dict["Біль у спині"] = back_pain_dict

# Herpes states
HERPES_DEFAULT_SYMPTOMS, HERPES_SYMPTOMS,\
    HERPES_ANTIVIRUS_MEDICINES, HERPES_MEDICINES = range(60, 64)

herpes_dict = {
    (INIT, "Герпетичне ураження губ"):
        (HERPES_DEFAULT_SYMPTOMS,
         "Характерні ознаки захворювання (свербіж, поколювання, печіння, "
         "болючість ділянки губ або висипання) з'явились нещодавно?"),
    (HERPES_DEFAULT_SYMPTOMS, "Так"):
        (HERPES_SYMPTOMS,
         "Чи наявні один або декілька загрозливих симптомів:\n\n"
         f"{red_circle_sign}поширення інфекції зі слизової оболонки губ "
         f"на слизову оболонку рота,\n"
         f"{red_circle_sign}нагноєння герпетичних висипань,\n"
         f"{red_circle_sign}ураження висипаннями великих ділянок шкіри "
         f"обличчя, особливо близько до очей, або на інших ділянках "
         f"тіла,\n"
         f"{red_circle_sign}висипання, які поєднуються з вираженою "
         f"болючістю, підвищенням температури тіла, погіршенням загального "
         f"стану,\n"
         f"{red_circle_sign}висипання з'явилися на статевих органах,\n"
         f"{red_circle_sign}висипання не зникають протягом 10 днів після "
         f"початку лікування,\n"
         f"{red_circle_sign}герпетичне ураження губ у вагітних,\n"
         f"{red_circle_sign}часті загострення захворювання (більше 6 разів "
         f"на рік)"
         ),
    (HERPES_DEFAULT_SYMPTOMS, "Ні"):
        (DONE,
         "Якщо захворювання триває більше 10 днів, для уточнення діагнозу "
         "і призначення лікування необхідно звернутися до лікаря"),
    (HERPES_SYMPTOMS, "Так"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування необхідно "
         "звернутися до лікаря"),
    (HERPES_SYMPTOMS, "Ні"):
        (HERPES_ANTIVIRUS_MEDICINES,
         "Чи був позитивний ефект від лікування противірусними препаратами, "
         "зокрема ацикловіром, якщо ви лікувалися ними раніше?"),
    (HERPES_ANTIVIRUS_MEDICINES, "Так"):
        (DONE,
         "Рекомендовані противірусні лікарські засоби для місцевого "
         "застосування, за необхідності - лікарські засоби з підсушувальною "
         "дією. Суворо дотримуватися правил особистої гігієни для "
         "запобігання перенесенню захворювання на інші частини тіла або "
         "зараженню членів родини та близьких:\n\n"
         f"{red_circle_sign}не торкатися висипань руками, а якщо це сталося - "
         f"ретельно вимити руки водою з милом,\n"
         f"{red_circle_sign}ні в якому разі не видавлювати пухирці та не "
         f"зривати скоринки,\n"
         f"{red_circle_sign}користуватися окремим рушником, посудом,\n"
         f"{red_circle_sign}у період висипань утримуватися від поцілунків "
         f"і орального сексу,\n"
         f"{red_circle_sign}особливо суворо дотримуватися правил необхідно "
         f"за наявності в родині дитини, оскільки діти важко переносять "
         f"герпетичну інфекцію"),
    (HERPES_ANTIVIRUS_MEDICINES, "Ні"):
        (HERPES_MEDICINES,
         "Чи має місце прийом таких лікарських засобів:\n\n"
         f"{red_circle_sign}глюкокортикоїдів,\n"
         f"{red_circle_sign}антинеопластичних засобів,\n"
         f"{red_circle_sign}інших імуносупресантів,\n"
         f"{red_circle_sign}антибактеріальних засобів,\n"
         f"{red_circle_sign}противірусних засобів"),
    (HERPES_MEDICINES, "Так"):
        (DONE,
         "Необхідно звернутися до лікаря за консультацією і "
         "корекцією лікування, оскільки стан пацієнта може бути зумовлений "
         "імунодепресією"),
    (HERPES_MEDICINES, "Ні"):
        (DONE,
         "Для уточнення діагнозу і призначення лікування необхідно "
         "звернутися до лікаря")
}

transitions_dict["Герпетичне ураження губ"] = herpes_dict
